app/controllers/api/v1/biodata_users_controller.rb

INSERT INTO "biodata_users" ("dob", "address", "marriage_status", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @biodata = BiodataUser.new(biodata_params.merge(user_id: @user.id))
        @biodata.save ? response_to_json({biodata:@biodata.new_attribute}, :success) : response_error(@biodata.errors, :unprocessable_entity)

SELECT "biodata_users".* FROM "biodata_users" WHERE "biodata_users"."user_id" = $1 LIMIT $2  [["user_id", 22], ["LIMIT", 1]]
---
    def find_one
        @biodata = BiodataUser.find_one_family(@user,params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
    def set_biodata
        @user_detail = User.find_by_id(@user.id)