app/controllers/api/v1/biodata_users_controller.rb

    def set_biodata
        @biodata = BiodataUser.find_by(user_id: @user.id)
---
SELECT "biodata_users".* FROM "biodata_users" WHERE "biodata_users"."user_id" = $1 LIMIT $2  [["user_id", 22], ["LIMIT", 1]]