app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events"
---
    def search_by_date
        @events = Event.get_all(@user)
        @event_by_date = @events.select{ |item| item[:date]==params[:date]}