app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."family_tree_id" = $1  [["family_tree_id", 2]]
---
    def index
        @events = Event.where(family_tree_id: params[:family_tree_id])

INSERT INTO "events" ("name", "date", "venue", "time", "user_id", "family_tree_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @event = Event.new(event_params.merge(user_id: @user.id))
        if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
---
    def destroy
        @event = Event.find_by_id(params[:id]).destroy

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "name" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["name", "arisan sendiri"], ["updated_at", "2022-10-18 06:33:40.888119"], ["id", 1]]
---
    def update
        @event = Event.find(params[:id])
        if @event.update(event_params)