app/controllers/api/v1/family_trees_controller.rb

  def create
    @family = FamilyTree.new(family_params.merge(user_id: @user.id))
      if @family.save
---
INSERT INTO "family_trees" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "uji family"], ["user_id", 4], ["created_at", "2022-10-17 04:31:53.805586"], ["updated_at", "2022-10-17 04:31:53.805586"]]

  def show
      @family = FamilyTree.find(params[:id])
---
SELECT "family_trees".* FROM "family_trees" WHERE "family_trees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @family = FamilyTree.find(params[:id])
    if @family.update(family_params)
---
SELECT "family_trees".* FROM "family_trees" WHERE "family_trees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "family_trees" SET "name" = $1, "updated_at" = $2 WHERE "family_trees"."id" = $3  [["name", "popo family"], ["updated_at", "2022-10-17 04:32:40.148024"], ["id", 1]]