app/controllers/api/v1/invitations_controller.rb

  def create
    @user = User.new(user_params)
    @user.password = params[:password]
    if params[:token].present?
      @user.save
      @relation=UserRelation.find_by(relation_id:@token["relation_id"])
---
INSERT INTO "users" ("name", "email", "phone", "password_digest", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."relation_id" = $1 LIMIT $2  [["relation_id", 4], ["LIMIT", 1]]

  def accepted
    @relation = UserRelation.find_by(relation_id: @token["relation_id"])
    @notif = Notification.find_by(user_id:@user.id,user_relation_id:@relation.id)
    @notif.update(status:"read")
---
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."relation_id" = $1 LIMIT $2  [["relation_id", 40], ["LIMIT", 1]]
UPDATE "user_relations" SET "connected_user_id" = $1, "updated_at" = $2 WHERE "user_relations"."id" = $3  [["connected_user_id", 17], ["updated_at", "2022-10-27 01:34:59.763740"], ["id", 27]]

  def create_user_relation
    @user_relation = UserRelation.find_by(relation_id: @token["relation_id"])
    @user_related = User.find_by_id(@user_relation.user_id)
    @relation = Relation.find_by(id: @user_relation.relation_id)
    @relation_detail = Relation.relation_detail(params[:relation_name])
    @new_relation = Relation.create(name:@user_related.name,relation_name:params["relation_name"],code:@relation_detail[0][:code],connected_user_id:@user_relation.user_id,user_id:@user.id, status:1)
---
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."relation_id" = $1  [["relation_id", 16]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "relations".* FROM "relations" WHERE "relations"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
INSERT INTO "relations" ("name", "relation_name", "position", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["relation_name", 2], ["position", 0], ["number", 1], ["created_at", "2022-10-27 01:29:31.972788"], ["updated_at", "2022-10-27 01:29:31.972788"]]