app/controllers/api/v1/passwords_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "test@gmail.com"], ["id", 4], ["LIMIT", 1]]
---
  def forgot
    if params[:email].blank? # check if email is present
      return render json: {error: "Email not present"}
    end

    user = User.find_by(email: params[:email]) # if present find user by email

    if user.present?

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def reset
    token = params[:token].to_s

    if params[:email].blank?
      return render json: {error: "Token not present"}
    end

    user = User.find_by(reset_password_token: token)