app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2022-10-18 09:38:14.242070"], ["id", 8]]
---
    def index
        @relation = UserRelation.find_by(user_id:@user.id)
        @relations = UserRelation.where(family_tree_id:@relation.family_tree_id)
        @all_posts =[]
        @relations.each do |relation,index|
            @posts = Post.where(user_id: relation.user_id)
            @posts.each do |post|
            @all_posts.push(@posts[0].new_attribute) if post !=nil

INSERT INTO "posts" ("title", "descriptions", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", nil], ["descriptions", "isi nya contoh untuk database"], ["status", "private"], ["created_at", "2022-10-25 09:45:45.595803"], ["updated_at", "2022-10-25 09:45:45.595803"], ["user_id", 1]]
---
    def create
        @post = Post.new(post_params.merge(user_id: @user.id))
        @post.save ? response_to_json(@post.new_attribute, :success) : response_error(@post.errors, :unprocessable_entity)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
---
    def find
        @posts = Post.where(user_id: @user.id)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 10]]
---
    def destroy
        if @user.id == @post.user_id
            @post.delete

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_post
        @post = Post.find_by_id(params[:id])