app/controllers/api/v1/relations_controller.rb

  def create
    @find = Relation.find_by(relation_params)
    if @find.present?
      response_to_json(@find,:ok)
    else
      @relation_detail=Relation.relation_detail(params[:relation_name])
      @relation = Relation.new(relation_params.merge(code:@relation_detail[0][:code],user_id:@user.id,connected_user_id:params["connected_user_id"],status:"non_active"))
      @relation.save ? response_to_json(@relation.get_relation_from_invitation, :success) : response_error(@relation.errors, :unprocessable_entity)
---
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."relation_id" = $1  [["relation_id", 7]]
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."relation_id" = $1  [["relation_id", 13]]
INSERT INTO "relations" ("name", "relation_name", "position", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "dhimas"], ["relation_name", 2], ["position", 0], ["number", 1], ["created_at", "2022-10-17 06:04:15.387985"], ["updated_at", "2022-10-17 06:04:15.387985"]]

  def update
    @relation = Relation.find(params[:id])
    @relation.update(relation_params) ? response_to_json({relation: @relation,message:"berhasil memperbarui hubungan"}, :success) : response_error(@relation.errors,:unprocessable_entity)
---
SELECT "relations".* FROM "relations" WHERE "relations"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "relations" SET "position" = $1, "updated_at" = $2 WHERE "relations"."id" = $3  [["position", 1], ["updated_at", "2022-10-21 05:36:45.798008"], ["id", 53]]