app/controllers/api/v1/user_relations_controller.rb

    def index
      @relation_detail =[]
      @relations = UserRelation.where(user_id: @user.id)
      @user=[]
      @relations.each do |relation|
        @relations_connected_user = UserRelation.where(connected_user_id:relation.connected_user_id)
        @relations_connected_user.each do |relation_connected_user|
        if relation.connected_user_id == nil
          @relation_detail.push(relation_detail:{user_relation:relation_connected_user.relation,relation:relation_connected_user.relation})
        else
          @user = User.find_by_id(relation_connected_user.connected_user_id)
          @relation_detail.push(relation_detail:{user_relation:relation_connected_user,relation:relation_connected_user.relation,user: @user,biodata:@user.biodata_user,avatar:@user.biodata_user.avatar.url})
        end
        end
      end
      @relations.each_with_index do |relation, index|
        if relation.connected_user_id == nil
          @relation_detail.push(relation_detail:{user_relation:relation.relation,relation:relation.relation})
        else
          @user = User.find_by_id(relation.connected_user_id)
---
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."user_id" = $1  [["user_id", 1]]
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."user_id" = $1 AND "user_relations"."connected_user_id" IS NOT NULL  [["user_id", 1]]
SELECT "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."connected_user_id" = $1  [["connected_user_id", 17]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "biodata_users".* FROM "biodata_users" WHERE "biodata_users"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
SELECT "relations".* FROM "relations" WHERE "relations"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

    def show
      @relation = UserRelation.find_by_id(params[:id])
      if @relation
        @user = User.find_by_id(@relation.connected_user_id)
---
SELECT "user_relations".* FROM "user_relations" WHERE "user_relations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]