app/controllers/api/v1/users_controller.rb

SELECT "users"."id", "users"."name", "users"."email", "users"."phone" FROM "users"
---
  def index
    @users = User.all.select('id', 'name','email','phone')

INSERT INTO "users" ("name", "email", "phone", "password_digest", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    if params[:password] != ""
    @user = User.new(user_params)
    @user.password = params[:password]
    @token = encode_token({user_id: @user.id, email: @user.email})
    @user.save ? response_to_json({user:@user,token:@token}, :ok) : response_error(@user.errors, :unprocessable_entity)

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "testing"], ["updated_at", "2022-10-20 00:43:31.147468"], ["id", 20]]
---
  def update
    @user.update(user_params) ? response_to_json(@user.new_attribute, :ok) : response_error(@user.errors, :unprocessable_entity)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 20]]
---
  def destroy
    @user.destroy ? response_to_json(@user.new_attribute, :success) : response_error(@user.errors, :error)