app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test10@gmail.com"], ["LIMIT", 1]]
---
  def authorized_user
    decoded_token = decoded_token()
    if decoded_token
      email = decoded_token[0]['email']
      @user = User.find_by_email(email)