app/controllers/biodata_users_controller.rb

INSERT INTO "biodata_users" ("dob", "address", "marriage_status", "status", "created_at", "updated_at", "user_id", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @biodata = BiodataUser.new(biodata_params.merge(user_id: @user.id))
        if @biodata.save

SELECT "biodata_users".* FROM "biodata_users" WHERE "biodata_users"."user_id" = $1 LIMIT $2  [["user_id", 41], ["LIMIT", 1]]
---
    def show
        @biodata = BiodataUser.find_by(user_id: @user.id)

SELECT "biodata_users".* FROM "biodata_users" WHERE "biodata_users"."user_id" = $1 LIMIT $2  [["user_id", 40], ["LIMIT", 1]]
UPDATE "biodata_users" SET "address" = $1, "updated_at" = $2 WHERE "biodata_users"."id" = $3  [["address", "gubug qatros"], ["updated_at", "2022-10-07 11:04:45.129485"], ["id", 1]]
---
    def update
        @biodata = BiodataUser.find_by(user_id: @user.id)
        if @biodata.update(biodata_params)