app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
    def index
        @posts = Post.all

INSERT INTO "posts" ("title", "link", "descriptions", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @post = Post.new(post_params.merge(user_id: @user.id))
        if @post.save