app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "phone", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.password = user_params[:password_digest]
    token = encode_token({user_id: @user.id})
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @user = User.find_by_id(@user.id)

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "admin21"], ["email", "admin12@gmail.com"], ["updated_at", "2022-10-06 11:48:07.263471"], ["id", 6]]
---
  def update
    if @user.update(user_params)