app/controllers/users_controller.rb

SELECT "users"."id", "users"."name", "users"."email", "users"."phone" FROM "users"
---
  def index
    @users = User.all.select('id', 'name','email','phone')

INSERT INTO "users" ("name", "email", "phone", "password_digest", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.password = params[:password]
    token = encode_token({user_id: @user.id, email: @user.email})
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @user = User.find_by_id(@user.id)

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "admin2111"], ["email", "dhim@mail.com"], ["updated_at", "2022-10-07 09:43:42.071342"], ["id", 16]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def destroy
    @user = User.find_by_id(@user.id).destroy