app/models/relation.rb

INSERT INTO "user_relations" ("connected_user_id", "status", "family_tree_id", "token", "user_id", "relation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def  build_user_relation
    token = JWT.encode({user_id: self.user_id, relation_id: self.id},'secret')
    @user_relation = self.user_relations.new(user_id: self.user_id, relation_id: self.id, family_tree_id: self.family_tree_id,connected_user_id: self.connected_user_id,token: token,status:self.status)
    @user_relation.save