app/models/user_relation.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def self.get_relation(user)
    @detail =[]
    @con_relations_user=[]
    @relations = UserRelation.where(user_id: user.id)
    @relations.map do |relation|
      if relation.connected_user_id == nil
        @detail.push(relation.no_connected_user_id)
      else
        @user_id = User.find_by_id(relation.connected_user_id)